---
layout:     post
title:      Cisco常用IOS命令
subtitle:   NAT,RIP,DHCP等
date:       2019-05-20
author:     Jorian
header-img: img/computer-networks.jpg
catalog: true
tags:
    - Cisco
    - 计算机网络
---

> 并不适合阅读的个人文档  
>
> 主要的Cisco常用IOS命令总结


### 基础配置
**1.从用户模式进入特权模式**  
R1>enable  
**2.从特权模式进入全局配置模式**  
R1#configure terminal  
**3.设置主机名**  
R1(config)#hostname R1  
**4.退出到特权模式**  
R1(config)#end  
**5.退出到用户模式**  
R1#disable
**6.退出控制台线路**  
R1>quit  
**7.通过console进入控制台口线路**  
R1(config)#line console {number}  
**8.启动光标跟随**  
R1(config-line)#logging synchronous  
**9.设置键盘多久无动作，自动被弹出到用户模式以外，即退出
（如果设置为0分0秒代表永不超时）**  
R1(config-line)#exec-timeout {minute}{second}  
**10.显示路由器的当前时间**  
R1#show clock  
**11.设置标语信息**
R1(config)#banner login # {text} #    //这个banner配置一些登陆前的提示  
R1(config)#banner motd  # {text} #   //这个banner配置一些成功登陆游的提示信息  
**12.进入接口配置模式**  
R1(config)#interface {type} {number}  
**13.为接口设置描述信息**  
R1(config-if)#description {text}  
**14.显示某个接口的配置信息**  
R1#show running-config interface {type}{number}
**15.设置特权模式进入密码**  
R1(config)#enable password {password}  //该密码是基于明文的(通过show running-config可见)  
R1(config)#enable secret {password}    //  该密码是基于MD5加密的  
注：密码是区分大小写的；如果同时设置了两种认证密码，只用后者生效  
**16.进入控制台口线路**  
R1(config)#line console {number}  //通过console线方式进入控制台  
R1(config)#line aux {number}       //通过辅助接口（AUX）线路进入控制台  
R1(config)#line vty {start-number}{end-number} //通过虚拟终端线路（VTY）进入控制台  
注：虚拟终端线路（VTY）是为telnet会话所用  
**17.设置控制台端口的密码**
R1(config-line)#password {password}    
注：这里的登录密码是明文方式保存在DRAM（running-config）文件中  
R1(config-line)#login   //启动登陆  
**18.关闭DNS查询功能**  
R1(config)#no ip domain lookup  
注：默认情况下，路由器的DNS查询是启用的，当输入一条Cisco IOS无法识别的命令时，路由器会把这个命令当成主机名，然后向DNS服务器进行查询。  
**19.ping测试**  
R1#ping {ip-address}  
**20.telnet测试**  
R1#telnet {ip-address}  
注：在telnet到远端路由器的时候，如果对方的VTY线路没有设置密码和启动登陆，将拒绝本地路由器telnet。  
解决方案：在远端路由器设置VTY线路的密码和启动登陆，如下配置：  
R1(config)#line vty {start-num} {end-number} //进入VTY线路  
R1(config-line)#password {password}    //设置密码  
R1(config-line)#login  // 启动登陆  
R1(config-line)#end  // 退出VTY线路  
**21.创建静态的IP地址到主机名的映射**  
R1(config)#ip host {hostname} {ip-address}  
**22.关闭CDP协议**  
R1(config)#no cdp run /*关闭CDP协议，不然会一直出现双工不匹配的提示*/  
R3(config)#no cdp run /*以后的实验，只要涉及到以太网接口，就关闭CDP*/  
**23.取消command(命令)**  
no command  



### 路由器配置  
**1.重启路由器**
Router#reload    
Router#reload [at {hh:mm day year} |in {minutes}][text]    
**2.其他配置**  
R1(config)#interface {type} {number}  
R1(config-if)#description {text}  
R1(config-if)#ip address {ip-address} {mask}//接口设置IP  
R1(config-if)#clock rate {speed}//DCE接口设置时钟  
R2(config-if)#no shutdown  
**3.恢复接口配置到出厂模式**  
R1(config)#default interface {type} {number}  
**4.显示接口配置信息**    
R1#show running-config interface {type}{number}  



### 交换机配置
S1#show mac-address-table//显示交换表  
S1(onfig)#ip http server//开启http服务（部分交换机可用）  
**配置超级用户口令：**  
S1(config)#enable password 123456 //不加密密码  
S1(config)#enable password 7 123456 //加密密码（7是选择的加密方式）  
S1(config)#enable secret 123456  //加密密码  
S1(config)#enable secret 5 123456  //加密密码（5是选择的加密方式）  

**配置vlan：**  
SW_1(config)#vlan 2  
SW_1(config-vlan)#name vlan2  
SW_1(config-vlan)#int f0/1  
SW_1(config-if)#switchport mode access   
SW_1(config-if)#switchport access vlan 2  

**配置trunk**  
SW_1(config)#int f0/3  
SW_1(config)#switchport encanpsulation dot1q(2960交换机默认该封装)  
SW_1(config-if)switchport trunk native vlan 100（可选）   
SW_1(config-if)#switchport mode trunk   
SW_1(config-if)#switchport nonegotiate（关闭DTP自动协商）  
SW_1(config-if)#switchport trunk allowed vlan 1-3  
**语法检查**  
SW_1#show interface trunck   



### show命令  
**1.show version**  
des:查看版本信息  
**2.show running-configure**  
des:查看运行配置信息  
**3.show startup-config**  
des:查看初始配置信息  
**4.show interfaces type number/trunk [switchport]**   
des:查看路由器各接口信息，加参数可查看某一端口状态  
**5.show controllers type number**  
des: 查看接口控制器信息，用于查看接口上连接的串行线是DCE线还是DTE线  
**6.show ip int brief**  
des:显示所有接口状态  
**7.show vlan brief**  
des:显示所有vlan状态    
**8.show ip route**  
des:显示路由信息  



### 静态路由配置  

**静态路由类型：**  
> 标准静态路由  
> 静态默认路由  
> 汇总静态路由  
> 浮动静态路由（备份路径的静态路由）  

**标准静态路由：**  
> 下一跳路由 - 仅指定下一跳 IP 地址（路由表查找两次；点对点，多点广播）  
> 直连静态路由 - 仅指定路由器退出接口（点对点广播）   
> 完全指定静态路由 - 指定下一跳 IP 地址和退出接口（多路访问网络）  
ipv4 :  
ip route network-address subnet-mask {ip-address | exit-intf}  
ipv6:  
ipv6 route ipv6-prefix/prefix-length {ipv6-address | exit-intf}  
注：  
ip-address:下一跳  
exit-intf: 用于将数据包转发到下一跳的送出接口。   
ipv6配置前，需启用单播路由：ipv6 unicast-routing  

**默认静态路由：** 
ipv4:  
ip route 0.0.0.0 0.0.0.0 {ip-address | exit-intf} 
ipv6:    
ipv6 route ::/0 {ipv6-address | exit-intf} 

**浮动静态路由：**  
默认情况下，静态路由的管理距离为 1，因此它们优先于通过动态路由协议获知的路由  
ip route network-address subnet-mask {ip-address | exit-intf} distance  
ipv6 route ipv6-prefix/prefix-length {ipv6-address | exit-intf} distance  

**验证：**  
show ipv6/ip route  
show ipv6/ip route static 
show ipv6/ip route network  



### 单臂路由  
R0(config)#inter f0/0   // 进入路由器和交换机相连的端口  
R0(config-if)#no shutdown   // 启用端口  
R0(config-if)#exit  
R0(config)#inter f0/0.1     // 进入逻辑子接口0.1  
R0(config-subif)#encapsulation dot1Q 10     // 设置协议封装并建立与vlan10的关联  
R0(config-subif)#ip add 192.168.1.254 255.255.255.0 // 设置ip地址（也就是网关地址）  
R0(config-subif)#exit  
R0(config)#inter f0/0.2  
R0(config-subif)#encapsulation dot1Q 20  
R0(config-subif)#ip add 192.168.2.254 255.255.255.0  
R0(config-subif)#exit  



### 三层交换配置  
**虚接口配置：**  
S1(config)#ip routing  
S1(config)#interface vlan 2  
S1(config-if)#ip address 172.16.3.154 255.255.255.0  
S1(config)#exit  

**trunk配置：**  
S1(config)#int f0/3  
S1(config)#switchport encanpsulation dot1q（必须先封装）  
S1(config-if)switchport trunk native vlan 100（可选）
S1(config-if)#switchport mode trunk   
S1(config-if)#switchport nonegotiate（关闭DTP自动协商）  
S1(config-if)#switchport trunk allowed vlan 1-3  

**路由接口配置：**  
S1(config)#interface f 0/1  
S1(config-if)#no switchport(端口配置为路由接口)  
S1(config-if)#ip address 172.16.2.154  255.255.255.0 



### RIP
Router(config)#router rip  
Router(config-router)#version 2  
Router(config-router)no auto-summary（关闭自动汇总）  
Router(config-router)passive-interface g 0/0（配置被动接口）  
Router(config-router)default-information originate（向RIPv2网络注入默认路由）  

**验证**  
show ip route rip  



### ACL  
**查看ACL配置：**  
show access-lists(best)  
show running-config  
**查看ACL方向和应用接口:**    
show ip interface interface-number     
show run(best)   
**配置中删除访问列表:**     
(config) int interface-number    
(config-if)no ip access-group access-list-number out/in  
(config) no access-list access-list-number  
**ipv4 ACL语法**   
标准： Router(config)# access-list access-list-number { deny | permit | *remark* } source [ source-wildcard ][ log ]  
source-wildcard:源的32位通配符掩码  
**配置标准ACL程序**  
R1(config)#access-list 1 perimit 192.168.10.0 0.0.0.255  
R1(config)#interface serial 0/0/0  
R1(config)#ip access-group out //激活接口上的现有ACL  
**ACL示例**  
拒绝特定主机允许特定子网  
![acl-refuse-host.png](https://i.loli.net/2019/05/21/5ce37c42b73d713924.png)  
命名ACL  
Router(config)ip access-list [standard | extend] name  
![name-acl.png](https://i.loli.net/2019/05/21/5ce37c42a0a8627335.png)  



### DHCP
**排除特定地址:**  
ip dhcp excluded-address low-address [high-address]  
**配置DHCPv4池:**  
ip dhcp pool pool-name  
**配置特定任务:**  
![Snipaste_2019-05-20_09-31-55.png](https://i.loli.net/2019/05/20/5ce203c18a30c64092.png)
**禁用/启用DHCPv4:**  
no/ service dhcp  
**显示了配置在Router上的DHCPv4命令:**  
show running-config | section dhcp  
**验证DHCPv4的运行:**  
show ip dhcp binding  
**验证路由器正在接收或发送消息:**  
show ip dhcp server statistics  
**PC释放/请求地址：**  
ipconfig /release ; ip config /renew  
**Router配置为DHCPv4中继代理:**  
interface int-number   
ip helper-address dhcp-address  
show ip interface (验证)  
**路由器配置为DHCPv4客户端:**  
interface int-number  
ip address dhcp  
no shut  
show ip interface (验证)  
**Attention:**  
配置默认网关注意是最接近客户端的LAN接口的地址。   
虽然只需要一个网关，但是如果有多个网关，您最多可以列出八个地址  



### NAT  
**静态NAT(9.2.1):**  
des: 静态 NAT 是内部地址与外部地址之间的一对一映射（永久映射）  
(config)ip nat inside source static local-ip global-ip(建立内部本地地址与内部全局地址之间的映射)  
(config)interface int-num（指定内部接口）  
(config-if)ip nat inside  
(config-if)ip address ip-address mask  
(config)exit  
(config)interface int-num（指定外部接口）  
(config-if)ip address ip-address mask  
(config-if)ip nat outside  
语法检查  
(config)interface int-num   
(config-if)ip nat inside/outside  

**动态NAT(9.2.2)**  
des:本地地址和全局地址之间的多对多地址映射（使用地址池） ![nat-dynamic.png](https://i.loli.net/2019/05/21/5ce3783c3ea3c36573.png) 


**PAT(端口地址转换;9.2.3)**    
des: 允许路由器为许多内部本地地址使用一个内部全局地址;路由器会保存来自更高层协议的足够信息（例如 *TCP* 或 *UDP* 端口号）  
为*多个公有 IPv4 地址*池配置 PAT： 
![PAT配置2](https://i.loli.net/2019/05/16/5cdcd37ad34bd79293.png)

![PAT配置1](https://i.loli.net/2019/05/16/5cdcd37ac6d2960803.png) 

为*单一公有 IPv4 地址*配置 PAT(没有定义NAT池，使用interface关键字识别外部IPV4地址):  
![单个PAT配置2](https://i.loli.net/2019/05/16/5cdcd55889d5620603.png)

![单个PAT配置1](https://i.loli.net/2019/05/16/5cdcd5587ed3c54925.png)

**验证NAT（动态，静态，PAT）**:  
show ip nat translations  
show ip nat statistics    



> 参考链接：  
- [思科基础命令大全](https://blog.csdn.net/chentiefeng521/article/details/51746733)